List dataSource=[
    {
      "display": "هندسة كهربائية",
      "value": "1",
    },
    {
      "display": "قطاع التجزئة",
      "value": "23",
    },
    {
      "display": "الهندسة",
      "value": "22",
    },
    {
      "display": "قطاع الجملة",
      "value": "25",
    },
    {
      "display": "قطاع منتجات وخدمات الأطفال",
      "value": "26",
    },
    {
      "display": "قطاع الصحة والعناية الشخصية",
      "value": "27",
    },
    {
      "display": "قطاع اللياقة البدنية",
      "value": "28",
    },
    {
      "display": "قطاع التعليم والتدريب والتوظيف",
      "value": "29",
    },
    {
      "display": "قطاع المنتجات والخدمات المنزلية",
      "value": "30",
    },
    {
      "display": "قطاع التنظيف والصيانة",
      "value": "31",
    },
    {
      "display": "قطاع المقاولات والاشغال العامة",
      "value": "32",
    },
    {
      "display": "قطاع الخدمات المالية وانشطة التأمين",
      "value": "33",
    },
    {
      "display": "قطاع السياحة والفندقة",
      "value": "34",
    },
    {
      "display": "قطاع التسلية والترفيه",
      "value": "35",
    },
    {
      "display": "قطاع الاعلام الصوتي والمسموع والمقروء",
      "value": "36",
    },
    {
      "display": "قطاع خدمات الاعمال العامة",
      "value": "37",
    },
    {
      "display": "قطاع التسويق والدعاية والاعلان",
      "value": "38",
    },
    {
      "display": "قطاع السفر والرحلات",
      "value": "39",
    },
    {
      "display": "قطاع السيارات",
      "value": "40",
    },
    {
      "display": "قطاع الانترنت وتكنلوجيا المعلومات",
      "value": "41",
    },
    {
      "display": "أخرى",
      "value": "42",
    },
  ];

  List<String> namesOfData = [
    "هندسة كهربائية",
    "قطاع التجزئة",
    "الهندسة",
    "قطاع الجملة",
    "قطاع منتجات وخدمات الأطفال",
    "قطاع الصحة والعناية الشخصية",
    "قطاع اللياقة البدنية",
    "قطاع التعليم والتدريب والتوظيف",
    "قطاع المنتجات والخدمات المنزلية",
    "قطاع التنظيف والصيانة",
    "قطاع المقاولات والاشغال العامة",
    "قطاع الخدمات المالية وانشطة التأمين",
    "قطاع السياحة والفندقة",
    "قطاع التسلية والترفيه",
    "قطاع الاعلام الصوتي والمسموع والمقروء",
    "قطاع خدمات الاعمال العامة",
    "قطاع التسويق والدعاية والاعلان",
    "قطاع السفر والرحلات",
    "قطاع السيارات",
    "قطاع الانترنت وتكنلوجيا المعلومات",
    "أخرى",
  ];

  List<String> idsOfData = [
    "1",
    "23",
    "22",
    "25",
    "26",
    "27",
    "28",
    "29",
    "30",
    "31",
    "32",
    "33",
    "34",
    "35",
    "36",
    "37",
    "38",
    "39",
    "40",
    "41",
    "42",
  ];

List state = [
  {
      "display": "مشروع قائم",
      "value": "1",
    },
    {
      "display": "فكرة",
      "value": "2",
    },
];